# Add AKAs to our sql Data Base and use it to merge more apropriately

In [183]:
import string as string
import pandas as pd
import numpy as np
import psycopg2 as psycopg2
import sql_functions as sqlf
from unidecode import unidecode

we have to import the eu_df from SQL to do the checks on what countries to choose and also the AKAS from csv
<br><br>
Plan:
- Get most important producing countries from EU
- del EU again
- filter AKAs by countries
- change from long to wide format

Import back to the other notebook and write the function there:
- transform all columns into lower + unidecode + depunctuation 
- adjust function to go through titles one by one.

### Import everything

In [184]:
schema = "capstone_24_4_group1"
schema

'capstone_24_4_group1'

In [185]:
imdb_query = f'''   SELECT *
                    FROM {schema}."IMDB_data"
                    '''

eu_query = f'''   SELECT *
                    FROM {schema}."movie_data_EU"
                    '''

In [186]:
imdb_df = sqlf.get_dataframe(imdb_query)
display(imdb_df.head())
imdb_df.shape

,tconst,primary_title,original_title,year,runtime,num_votes,average_rating,genres_count,genre,genre2,...,acting5,directors_count,director_name,director2_name,director3_name,writers_count,writer_name,writer2_name,writer3_name,is_adult
0,tt0013274,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,2021,94,73.0,6.7,1.0,Documentary,None,...,None,2.0,Nikolai Izvolov,Dziga Vertov,None,NaN,None,None,None,0
1,tt0015414,La tierra de los toros,La tierra de los toros,2000,60,17.0,5.4,NaN,None,None,...,None,1.0,Musidora,None,None,NaN,None,None,None,0
2,tt0035423,Kate & Leopold,Kate & Leopold,2001,118,89944.0,6.4,3.0,Comedy,Fantasy,...,Natasha Lyonne,1.0,James Mangold,None,None,2.0,Steven Rogers,James Mangold,None,0
3,tt0062336,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,2020,70,190.0,6.5,1.0,Drama,None,...,Luis Vilches,2.0,Raúl Ruiz,Valeria Sarmiento,None,2.0,Raúl Ruiz,Omar Saavedra Santis,None,0
4,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122,8143.0,6.7,1.0,Drama,None,...,Norman Foster,1.0,Orson Welles,None,None,2.0,Orson Welles,Oja Kodar,None,0

(188163, 25)

In [187]:
eu_df = sqlf.get_dataframe(eu_query)
display(eu_df.head())
eu_df.shape

,title,producing_country,year,tickets_sold_since_1996,tickets_sold
0,(500) Days of Summer,US,2009,1713086,1684771
1,(Nie)znajomi,PL,2019,685075,684833
2,(T)Raumschiff Surprise - Periode 1,DE,2004,10763531,10731881
3,1 1/2 Ritter - Auf der Suche nach der hinreiße...,DE,2008,1986168,1986168
4,1 chance sur 2,FR,1998,1295620,1238175

(4956, 5)

In [188]:
producing_eu = eu_df["producing_country"].str.split(",").apply(lambda x: ' '.join(dict.fromkeys(x).keys()))
display(producing_eu[producing_eu.str.len() <= 2].unique())
display(len(producing_eu[producing_eu.str.len() <= 2].unique()))
producing_eu[producing_eu.str.len() <= 2].value_counts().head(10)

array(['US', 'PL', 'DE', 'FR', 'IT', 'AU', 'TR', 'GB', 'CZ', 'RO', 'ES',
       'NL', 'SE', 'MX', 'IE', 'DK', 'NO', 'HU', 'CA', 'JP', 'GR', 'AR',
       'KR', 'AT', 'IN', 'IR', 'RS', 'ZA', 'BE', 'UA', 'CH', 'RU', 'TH',
       'CS', 'HK'], dtype=object)

35

producing_country
US    1910
FR     458
DE     231
TR     182
IT     172
ES     107
GB      87
PL      85
NL      22
JP      19
Name: count, dtype: int64

### Countries we need:
countries = ["FR", "DE", "TR", "IT", "ES", "GB", "PL", "NL"]

In [189]:
del eu_df

In [190]:
countries = ["FR", "DE", "TR", "IT", "ES", "GB", "PL", "NL"]

### Import AKAs and filter for the countries of interest

In [191]:
akas_df = pd.read_csv("Data/title.principals/title.akas.csv", na_values="\\N")

/var/folders/4w/4tr10mrx69334wpfj60r7s3c0000gn/T/ipykernel_16793/1831301577.py:1: DtypeWarning: Columns (6) have mixed types. Specify dtype option on import or set low_memory=False.
  akas_df = pd.read_csv("Data/title.principals/title.akas.csv", na_values="\\N")

In [192]:
display(akas_df.head())
akas_df.shape

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Carmencita,NaN,NaN,original,NaN,1.0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0.0
2,tt0000001,3,Carmencita,US,NaN,imdbDisplay,NaN,0.0
3,tt0000001,4,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0.0
4,tt0000001,5,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0.0

(46896298, 8)

In [193]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46896298 entries, 0 to 46896297
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 2.8+ GB

In [194]:
akas_df.drop(akas_df[~akas_df["region"].isin(countries)].index, inplace=True)
display(akas_df.shape)
akas_df.head(10)

(18833987, 8)

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0.0
11,tt0000002,4,Der Clown und seine Hunde,DE,NaN,NaN,literal title,0.0
12,tt0000002,5,Le clown et ses chiens,FR,NaN,imdbDisplay,NaN,0.0
17,tt0000003,2,Armer Pierrot,DE,NaN,NaN,literal title,0.0
18,tt0000003,3,Pauvre Pierrot,FR,NaN,imdbDisplay,NaN,0.0
19,tt0000003,4,Poor Pierrot,GB,NaN,imdbDisplay,NaN,0.0
28,tt0000004,4,Ein gutes Glas Bier,DE,NaN,NaN,literal title,0.0
29,tt0000004,5,Un bon bock,FR,NaN,imdbDisplay,NaN,0.0
34,tt0000005,10,The Blacksmith's Forge,GB,NaN,NaN,informal alternative title,0.0
41,tt0000005,6,Blacksmith Shop,GB,NaN,NaN,informal alternative title,0.0

In [195]:
akas_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 18833987 entries, 1 to 46896284
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  float64
dtypes: float64(1), int64(1), object(6)
memory usage: 1.3+ GB

### Ok everything else creates humongous numbers of columns (~400+) ... 

-> so we just drop every occurence of another name for the same region after the first ...

In [196]:
akas_df.drop(columns=["ordering", "language", "types", "attributes", "isOriginalTitle"], inplace=True)

In [197]:
display(akas_df.shape)
akas_df.head()

(18833987, 3)

      titleId                      title region
1   tt0000001                 Carmencita     DE
11  tt0000002  Der Clown und seine Hunde     DE
12  tt0000002     Le clown et ses chiens     FR
17  tt0000003              Armer Pierrot     DE
18  tt0000003             Pauvre Pierrot     FR

In [198]:
akas_df[akas_df[["titleId", "region"]].duplicated()]

            titleId                                         title region
41        tt0000005                               Blacksmith Shop     GB
69        tt0000008                              Fred Otts Niesen     DE
80        tt0000010     La sortie des ouvriers de l'usine Lumière     FR
81        tt0000010                  La sortie des usines Lumière     FR
86        tt0000010                                Sortie d'usine     FR
...             ...                                           ...    ...
46887574  tt9906264              Secrets of Your Supermarket Food     GB
46887575  tt9906264              Secrets of Your Supermarket Shop     GB
46892287  tt9907728  Who Needs a Man When You've Got a Spray Tan?     GB
46892519  tt9907782                                    The Cursed     FR
46896194  tt9909102                  Big Trouble in Model Britain     GB

[72980 rows x 3 columns]

In [199]:
akas_df.drop(akas_df[akas_df[["titleId", "region"]].duplicated()].index, inplace=True)

In [200]:
display(akas_df.shape)
display(akas_df.head())
display(akas_df["region"].unique())

(18761007, 3)

      titleId                      title region
1   tt0000001                 Carmencita     DE
11  tt0000002  Der Clown und seine Hunde     DE
12  tt0000002     Le clown et ses chiens     FR
17  tt0000003              Armer Pierrot     DE
18  tt0000003             Pauvre Pierrot     FR

array(['DE', 'FR', 'GB', 'PL', 'IT', 'ES', 'TR', 'NL'], dtype=object)

In [201]:
akas_df_wide = akas_df.pivot(index= "titleId", columns="region", values="title")

In [202]:
display(akas_df_wide.shape)
display(akas_df.shape)
imdb_df.shape

(5315776, 8)

(18761007, 3)

(188163, 25)

In [203]:
akas_df_wide.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5315776 entries, tt0000001 to tt9909180
Data columns (total 8 columns):
 #   Column  Dtype
---  ------  -----
 0   DE      object
 1   ES      object
 2   FR      object
 3   GB      object
 4   IT      object
 5   NL      object
 6   PL      object
 7   TR      object
dtypes: object(8)
memory usage: 365.0+ MB

### Now finally filter for tconst from the imdb data

In [204]:
t_list = list(imdb_df["tconst"])

In [205]:
akas_df_wide.index.isin(t_list).sum()

112431

In [206]:
akas_df_wide.drop(akas_df_wide[~akas_df_wide.index.isin(t_list)].index, inplace=True)

In [207]:
display(akas_df_wide.shape)
display(akas_df.shape)
imdb_df.shape

(112431, 8)

(18761007, 3)

(188163, 25)

In [212]:
akas_df_wide.head()

region,DE,ES,FR,GB,IT,NL,PL,TR
titleId,,,,,,,,
tt0013274,NaN,NaN,Histoire de la guerre civile,NaN,NaN,NaN,NaN,NaN
tt0015414,NaN,La tierra de los toros,La terre des taureaux,NaN,NaN,NaN,NaN,NaN
tt0035423,Kate und Leopold,La Kate i en Leopold,Kate et Léopold,Kate & Leopold,Kate and Leopold,NaN,Kate i Leopold,Büyülü çift
tt0062336,NaN,NaN,El Tango del Viudo y Su Espejo Deformante,The Tango of the Widower and Its Distorting Mi...,NaN,NaN,NaN,NaN
tt0069049,The Other Side of the Wind,Al otro lado del viento,De l'autre côté du vent,The Other Side of the Wind,L'altra faccia del vento,NaN,Druga strona wiatru,NaN

In [217]:
akas_df_wide.reset_index(inplace=True)

In [221]:
akas_df_wide.columns = ['tconst', 'DE', 'ES', 'FR', 'GB', 'IT', 'NL', 'PL', 'TR']

In [222]:
akas_df_wide.head()

,tconst,DE,ES,FR,GB,IT,NL,PL,TR
0,tt0013274,NaN,NaN,Histoire de la guerre civile,NaN,NaN,NaN,NaN,NaN
1,tt0015414,NaN,La tierra de los toros,La terre des taureaux,NaN,NaN,NaN,NaN,NaN
2,tt0035423,Kate und Leopold,La Kate i en Leopold,Kate et Léopold,Kate & Leopold,Kate and Leopold,NaN,Kate i Leopold,Büyülü çift
3,tt0062336,NaN,NaN,El Tango del Viudo y Su Espejo Deformante,The Tango of the Widower and Its Distorting Mi...,NaN,NaN,NaN,NaN
4,tt0069049,The Other Side of the Wind,Al otro lado del viento,De l'autre côté du vent,The Other Side of the Wind,L'altra faccia del vento,NaN,Druga strona wiatru,NaN

# Upload the AKA_DF

In [227]:
table_name = 'imdb_akas_data'

In [231]:
engine = sqlf.get_engine()
engine

Engine(postgresql://user:***@host/database)

In [233]:
engine != None

True

In [224]:
schema

'capstone_24_4_group1'

In [234]:
# Write records stored in a dataframe to SQL database
if engine != None:
    try:
        akas_df_wide.to_sql(table_name, # Name of SQL table
                        con=engine, # Engine or connection
                        if_exists='replace', # Drop the table before inserting new values 
                        schema=schema, # your class schema
                        index=False, # Write DataFrame index as a column
                        chunksize=5000, # Specify the number of rows in each batch to be written at a time
                        method='multi') # Pass multiple values in a single INSERT clause
        print(f"The {table_name} table was imported successfully.")
    # Error handling
    except (Exception, psycopg2.DatabaseError) as error:
        print(error)
        engine = None
else:
    print("shit")

The imdb_akas_data table was imported successfully.